<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"a3b17b3ee3505156904d6ecec76db17fd33b53faf407d7e52bee21704b162b6a","plan_job_ref":"Job Tofu Plan for Maid Caf\u00e9 #9 at https://github.com/acm-uic/IaC/actions/runs/15225367683","plan_out_hash":"466cdb5d098b32588b5dbf0ea784a134e255b0a46e4325624248f42f7b41c175","plan_hash":"8fb8f88c42646a987e6cbb777ac9316ae15d10ad9be6ef274d3b369c62042ce6","plan_text_format":"diff","version":"1.48.0"} -->
OpenTofu plan in __proxmox/terraform/stacks/maid-cafe-k8s__ in the __prod__ workspace
With var files: `proxmox/terraform/stacks/maid-cafe-k8s/configuration/prod.tfvars`
<details>
<summary>Plan: 7 to add, 1 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

OpenTofu will perform the following actions:

  # proxmox_vm_qemu.k8s_01 will be updated in-place
!~  resource "proxmox_vm_qemu" "k8s_01" {
        id                     = "boba/qemu/104"
        name                   = "k8s-01"
+       pool                   = "Kubernetes"
#        (35 unchanged attributes hidden)

!~      disk {
            id                   = 0
!~          iothread             = false -> true
-           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso" -> null
+           size                 = "100G"
!~          slot                 = "ide2" -> "virtio0"
+           storage              = "ceph"
!~          type                 = "cdrom" -> "disk"
#            (17 unchanged attributes hidden)
        }
!~      disk {
-           format               = "raw" -> null
            id                   = 2
-           iothread             = true -> null
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
!~          slot                 = "virtio0" -> "ide2"
-           storage              = "ceph" -> null
!~          type                 = "disk" -> "cdrom"
#            (18 unchanged attributes hidden)
        }

#        (6 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s_02 will be created
+   resource "proxmox_vm_qemu" "k8s_02" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 4096
+       name                   = "k8s-02"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "chai"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 4
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:52:BC:A2"
+           model     = "virtio"
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

  # proxmox_vm_qemu.k8s_03 will be created
+   resource "proxmox_vm_qemu" "k8s_03" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 4096
+       name                   = "k8s-03"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "coffee"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 4
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:E4:10:66"
+           model     = "virtio"
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

  # proxmox_vm_qemu.k8s_04 will be created
+   resource "proxmox_vm_qemu" "k8s_04" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 16384
+       name                   = "k8s-04"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "matcha"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 8
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:6A:47:0D"
+           model     = "virtio"
+           tag       = 9
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

  # proxmox_vm_qemu.k8s_05 will be created
+   resource "proxmox_vm_qemu" "k8s_05" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 16384
+       name                   = "k8s-05"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "boba"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 8
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:58:3F:9C"
+           model     = "virtio"
+           tag       = 9
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

  # proxmox_vm_qemu.k8s_06 will be created
+   resource "proxmox_vm_qemu" "k8s_06" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 16384
+       name                   = "k8s-06"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "chai"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 8
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:FA:4F:36"
+           model     = "virtio"
+           tag       = 9
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

  # proxmox_vm_qemu.k8s_07 will be created
+   resource "proxmox_vm_qemu" "k8s_07" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 16384
+       name                   = "k8s-07"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "coffee"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 8
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:DB:EA:91"
+           model     = "virtio"
+           tag       = 9
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

  # proxmox_vm_qemu.k8s_08 will be created
+   resource "proxmox_vm_qemu" "k8s_08" {
+       additional_wait        = 5
+       agent                  = 0
+       agent_timeout          = 90
+       automatic_reboot       = true
+       balloon                = 0
+       bios                   = "ovmf"
+       boot                   = "order=virtio0;ide2;net0"
+       bootdisk               = (known after apply)
+       ciupgrade              = false
+       clone_wait             = 10
+       current_node           = (known after apply)
+       default_ipv4_address   = (known after apply)
+       default_ipv6_address   = (known after apply)
+       define_connection_info = true
+       desc                   = "Managed by Terraform."
+       force_create           = false
+       full_clone             = true
+       hotplug                = "network,disk,usb"
+       id                     = (known after apply)
+       kvm                    = true
+       linked_vmid            = (known after apply)
+       memory                 = 16384
+       name                   = "k8s-08"
+       onboot                 = true
+       os_type                = "l26"
+       pool                   = "Kubernetes"
+       protection             = false
+       reboot_required        = (known after apply)
+       scsihw                 = "virtio-scsi-single"
+       skip_ipv4              = false
+       skip_ipv6              = false
+       ssh_host               = (known after apply)
+       ssh_port               = (known after apply)
+       tablet                 = true
+       tags                   = (known after apply)
+       target_node            = "matcha"
+       unused_disk            = (known after apply)
+       vm_state               = "stopped"
+       vmid                   = (known after apply)

+       cpu {
+           cores   = 8
+           limit   = 0
+           numa    = false
+           sockets = 1
+           type    = "x86-64-v2-AES"
+           units   = 0
+           vcores  = 0
        }

+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iothread             = true
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = "100G"
+           slot                 = "virtio0"
+           storage              = "ceph"
+           type                 = "disk"
        }
+       disk {
+           backup               = true
+           id                   = (known after apply)
+           iops_r_burst         = 0
+           iops_r_burst_length  = 0
+           iops_r_concurrent    = 0
+           iops_wr_burst        = 0
+           iops_wr_burst_length = 0
+           iops_wr_concurrent   = 0
+           iso                  = "cephfs:iso/taloslinux-cached-amd64-20250522.iso"
+           linked_disk_id       = (known after apply)
+           mbps_r_burst         = 0
+           mbps_r_concurrent    = 0
+           mbps_wr_burst        = 0
+           mbps_wr_concurrent   = 0
+           passthrough          = false
+           size                 = (known after apply)
+           slot                 = "ide2"
+           type                 = "cdrom"
        }

+       efidisk {
+           efitype           = "4m"
+           pre_enrolled_keys = false
+           storage           = "ceph"
        }

+       network {
+           bridge    = "speed2"
+           firewall  = true
+           id        = 0
+           link_down = false
+           macaddr   = "BC:24:11:7C:00:45"
+           model     = "virtio"
+           tag       = 9
        }

+       smbios (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "5m"
        }

+       tpm_state {
+           storage = "ceph"
+           version = "v2.0"
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+   k8s-02_vm_id = (known after apply)
+   k8s-03_vm_id = (known after apply)
+   k8s-04_vm_id = (known after apply)
+   k8s-05_vm_id = (known after apply)
+   k8s-06_vm_id = (known after apply)
+   k8s-07_vm_id = (known after apply)
+   k8s-08_vm_id = (known after apply)
```
</details>

:memo: Plan generated in [Tofu Plan for Maid Café #9](https://github.com/acm-uic/IaC/actions/runs/15225367683)